'''
向量空间

在数学上 任意一个三维行向量X = （x1,x2,x3）

都可以被写为X  = x1(1,0,0) + x2(0,1,0) + x3(0,0,1)

这里有向量空间 三维空间的基的概念 同时也有向量的加法的概念

'''

'''
在数学上 特征向量 与 特征值 并非只定义在 对称矩阵上
事实上对任意一个方针M 满足下面的公式的向量和实数 分别为M的特征向量
与特征值
 M(w)T = 𝛌(w)T

 这里插入一个公式的记忆

 关于逆矩阵   (k*A)的逆矩阵 等于 （1/k）*（（A）的逆）

'''

'''
导数和积分 

在数据科学领域 积分被更多地用于理论研究 接触的机会少

但是导数被大量应用 主要用于工程实现（求解最优化问题）

速度函数曲线 V(t) = at; a是加速度  t为时间变量

位移函数曲线 S(t) = (1/2) * a * (t)²

这里 v 函数曲线积分 得到 位移函数曲线 S

位移函数曲线 S 求导得到 速度函数曲线 V

这里再引申 位移函数曲线 求 平均速度的公式

( l(t1) - l(t2) )/( t1 - t2 ) 得到平均速度

当我们求极限便得到某一时刻的瞬时速度 


而瞬时速度曲线 就是 V(t) 速度函数曲线

但是速度函数曲线表达式 却是 V = at， a为加速度 t为时间变量
 

'''












